{"modelTopology": {"backend": "tensorflow", "model_config": {"config": {"layers": [{"config": {"dtype": "float32", "name": "input_1", "batch_input_shape": [null, 224, 224, 3], "sparse": false}, "name": "input_1", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"use_bias": true, "kernel_size": [3, 3], "name": "conv2d_1", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [2, 2], "bias_constraint": null, "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_1", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "center": true, "axis": -1, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null}, "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu6"}, "name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"use_bias": true, "kernel_size": [1, 1], "name": "conv2d_2", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_constraint": null, "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_2", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "center": true, "axis": -1, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null}, "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu6"}, "name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"use_bias": true, "kernel_size": [3, 3], "name": "depthwise_conv2d_1", "depth_multiplier": 1, "activation": "linear", "data_format": "channels_last", "depthwise_regularizer": null, "depthwise_constraint": null, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "depthwise_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null}, "name": "depthwise_conv2d_1", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "class_name": "DepthwiseConv2D"}, {"config": {"name": "batch_normalization_3", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "center": true, "axis": -1, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null}, "name": "batch_normalization_3", "inbound_nodes": [[["depthwise_conv2d_1", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu6"}, "name": "activation_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"use_bias": true, "kernel_size": [1, 1], "name": "conv2d_3", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_constraint": null, "filters": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv2d_3", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_4", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "center": true, "axis": -1, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null}, "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"use_bias": true, "kernel_size": [1, 1], "name": "conv2d_4", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_constraint": null, "filters": 96, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv2d_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_5", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "center": true, "axis": -1, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null}, "name": "batch_normalization_5", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_4", "activation": "relu6"}, "name": "activation_4", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"use_bias": true, "kernel_size": [3, 3], "name": "depthwise_conv2d_2", "depth_multiplier": 1, "activation": "linear", "data_format": "channels_last", "depthwise_regularizer": null, "depthwise_constraint": null, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "depthwise_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [2, 2], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null}, "name": "depthwise_conv2d_2", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "class_name": "DepthwiseConv2D"}, {"config": {"name": "batch_normalization_6", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "center": true, "axis": -1, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null}, "name": "batch_normalization_6", "inbound_nodes": [[["depthwise_conv2d_2", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_5", "activation": "relu6"}, "name": "activation_5", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"use_bias": true, "kernel_size": [1, 1], "name": "conv2d_5", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_constraint": null, "filters": 24, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv2d_5", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_7", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "center": true, "axis": -1, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null}, "name": "batch_normalization_7", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"use_bias": true, "kernel_size": [1, 1], "name": "conv2d_6", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_constraint": null, "filters": 144, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv2d_6", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_8", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "center": true, "axis": -1, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null}, "name": "batch_normalization_8", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_6", "activation": "relu6"}, "name": "activation_6", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"use_bias": true, "kernel_size": [3, 3], "name": "depthwise_conv2d_3", "depth_multiplier": 1, "activation": "linear", "data_format": "channels_last", "depthwise_regularizer": null, "depthwise_constraint": null, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "depthwise_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null}, "name": "depthwise_conv2d_3", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "class_name": "DepthwiseConv2D"}, {"config": {"name": "batch_normalization_9", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "center": true, "axis": -1, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null}, "name": "batch_normalization_9", "inbound_nodes": [[["depthwise_conv2d_3", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_7", "activation": "relu6"}, "name": "activation_7", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"use_bias": true, "kernel_size": [1, 1], "name": "conv2d_7", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_constraint": null, "filters": 24, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv2d_7", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_10", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "center": true, "axis": -1, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null}, "name": "batch_normalization_10", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "add_1"}, "name": "add_1", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}], ["batch_normalization_7", 0, 0, {}]]], "class_name": "Add"}, {"config": {"use_bias": true, "kernel_size": [1, 1], "name": "conv2d_8", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_constraint": null, "filters": 144, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv2d_8", "inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_11", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "center": true, "axis": -1, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null}, "name": "batch_normalization_11", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_8", "activation": "relu6"}, "name": "activation_8", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"use_bias": true, "kernel_size": [3, 3], "name": "depthwise_conv2d_4", "depth_multiplier": 1, "activation": "linear", "data_format": "channels_last", "depthwise_regularizer": null, "depthwise_constraint": null, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "depthwise_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [2, 2], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null}, "name": "depthwise_conv2d_4", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "class_name": "DepthwiseConv2D"}, {"config": {"name": "batch_normalization_12", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "center": true, "axis": -1, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null}, "name": "batch_normalization_12", "inbound_nodes": [[["depthwise_conv2d_4", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_9", "activation": "relu6"}, "name": "activation_9", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"use_bias": true, "kernel_size": [1, 1], "name": "conv2d_9", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_constraint": null, "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv2d_9", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_13", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "center": true, "axis": -1, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null}, "name": "batch_normalization_13", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"use_bias": true, "kernel_size": [1, 1], "name": "conv2d_10", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_constraint": null, "filters": 192, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv2d_10", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_14", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "center": true, "axis": -1, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null}, "name": "batch_normalization_14", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_10", "activation": "relu6"}, "name": "activation_10", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"use_bias": true, "kernel_size": [3, 3], "name": "depthwise_conv2d_5", "depth_multiplier": 1, "activation": "linear", "data_format": "channels_last", "depthwise_regularizer": null, "depthwise_constraint": null, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "depthwise_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null}, "name": "depthwise_conv2d_5", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "class_name": "DepthwiseConv2D"}, {"config": {"name": "batch_normalization_15", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "center": true, "axis": -1, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null}, "name": "batch_normalization_15", "inbound_nodes": [[["depthwise_conv2d_5", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_11", "activation": "relu6"}, "name": "activation_11", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"use_bias": true, "kernel_size": [1, 1], "name": "conv2d_11", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_constraint": null, "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv2d_11", "inbound_nodes": [[["activation_11", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_16", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "center": true, "axis": -1, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null}, "name": "batch_normalization_16", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "add_2"}, "name": "add_2", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}], ["batch_normalization_13", 0, 0, {}]]], "class_name": "Add"}, {"config": {"use_bias": true, "kernel_size": [1, 1], "name": "conv2d_12", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_constraint": null, "filters": 192, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv2d_12", "inbound_nodes": [[["add_2", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_17", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "center": true, "axis": -1, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null}, "name": "batch_normalization_17", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_12", "activation": "relu6"}, "name": "activation_12", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"use_bias": true, "kernel_size": [3, 3], "name": "depthwise_conv2d_6", "depth_multiplier": 1, "activation": "linear", "data_format": "channels_last", "depthwise_regularizer": null, "depthwise_constraint": null, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "depthwise_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null}, "name": "depthwise_conv2d_6", "inbound_nodes": [[["activation_12", 0, 0, {}]]], "class_name": "DepthwiseConv2D"}, {"config": {"name": "batch_normalization_18", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "center": true, "axis": -1, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null}, "name": "batch_normalization_18", "inbound_nodes": [[["depthwise_conv2d_6", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_13", "activation": "relu6"}, "name": "activation_13", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"use_bias": true, "kernel_size": [1, 1], "name": "conv2d_13", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_constraint": null, "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv2d_13", "inbound_nodes": [[["activation_13", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_19", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "center": true, "axis": -1, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null}, "name": "batch_normalization_19", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "add_3"}, "name": "add_3", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}], ["add_2", 0, 0, {}]]], "class_name": "Add"}, {"config": {"use_bias": true, "kernel_size": [1, 1], "name": "conv2d_14", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_constraint": null, "filters": 192, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv2d_14", "inbound_nodes": [[["add_3", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_20", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "center": true, "axis": -1, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null}, "name": "batch_normalization_20", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_14", "activation": "relu6"}, "name": "activation_14", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"use_bias": true, "kernel_size": [3, 3], "name": "depthwise_conv2d_7", "depth_multiplier": 1, "activation": "linear", "data_format": "channels_last", "depthwise_regularizer": null, "depthwise_constraint": null, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "depthwise_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [2, 2], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null}, "name": "depthwise_conv2d_7", "inbound_nodes": [[["activation_14", 0, 0, {}]]], "class_name": "DepthwiseConv2D"}, {"config": {"name": "batch_normalization_21", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "center": true, "axis": -1, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null}, "name": "batch_normalization_21", "inbound_nodes": [[["depthwise_conv2d_7", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_15", "activation": "relu6"}, "name": "activation_15", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"use_bias": true, "kernel_size": [1, 1], "name": "conv2d_15", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_constraint": null, "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv2d_15", "inbound_nodes": [[["activation_15", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_22", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "center": true, "axis": -1, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null}, "name": "batch_normalization_22", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"use_bias": true, "kernel_size": [1, 1], "name": "conv2d_16", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_constraint": null, "filters": 384, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv2d_16", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_23", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "center": true, "axis": -1, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null}, "name": "batch_normalization_23", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_16", "activation": "relu6"}, "name": "activation_16", "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"use_bias": true, "kernel_size": [3, 3], "name": "depthwise_conv2d_8", "depth_multiplier": 1, "activation": "linear", "data_format": "channels_last", "depthwise_regularizer": null, "depthwise_constraint": null, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "depthwise_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null}, "name": "depthwise_conv2d_8", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "class_name": "DepthwiseConv2D"}, {"config": {"name": "batch_normalization_24", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "center": true, "axis": -1, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null}, "name": "batch_normalization_24", "inbound_nodes": [[["depthwise_conv2d_8", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_17", "activation": "relu6"}, "name": "activation_17", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"use_bias": true, "kernel_size": [1, 1], "name": "conv2d_17", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_constraint": null, "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv2d_17", "inbound_nodes": [[["activation_17", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_25", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "center": true, "axis": -1, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null}, "name": "batch_normalization_25", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "add_4"}, "name": "add_4", "inbound_nodes": [[["batch_normalization_25", 0, 0, {}], ["batch_normalization_22", 0, 0, {}]]], "class_name": "Add"}, {"config": {"use_bias": true, "kernel_size": [1, 1], "name": "conv2d_18", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_constraint": null, "filters": 384, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv2d_18", "inbound_nodes": [[["add_4", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_26", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "center": true, "axis": -1, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null}, "name": "batch_normalization_26", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_18", "activation": "relu6"}, "name": "activation_18", "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"use_bias": true, "kernel_size": [3, 3], "name": "depthwise_conv2d_9", "depth_multiplier": 1, "activation": "linear", "data_format": "channels_last", "depthwise_regularizer": null, "depthwise_constraint": null, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "depthwise_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null}, "name": "depthwise_conv2d_9", "inbound_nodes": [[["activation_18", 0, 0, {}]]], "class_name": "DepthwiseConv2D"}, {"config": {"name": "batch_normalization_27", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "center": true, "axis": -1, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null}, "name": "batch_normalization_27", "inbound_nodes": [[["depthwise_conv2d_9", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_19", "activation": "relu6"}, "name": "activation_19", "inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"use_bias": true, "kernel_size": [1, 1], "name": "conv2d_19", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_constraint": null, "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv2d_19", "inbound_nodes": [[["activation_19", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_28", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "center": true, "axis": -1, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null}, "name": "batch_normalization_28", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "add_5"}, "name": "add_5", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}], ["add_4", 0, 0, {}]]], "class_name": "Add"}, {"config": {"use_bias": true, "kernel_size": [1, 1], "name": "conv2d_20", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_constraint": null, "filters": 384, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv2d_20", "inbound_nodes": [[["add_5", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_29", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "center": true, "axis": -1, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null}, "name": "batch_normalization_29", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_20", "activation": "relu6"}, "name": "activation_20", "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"use_bias": true, "kernel_size": [3, 3], "name": "depthwise_conv2d_10", "depth_multiplier": 1, "activation": "linear", "data_format": "channels_last", "depthwise_regularizer": null, "depthwise_constraint": null, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "depthwise_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null}, "name": "depthwise_conv2d_10", "inbound_nodes": [[["activation_20", 0, 0, {}]]], "class_name": "DepthwiseConv2D"}, {"config": {"name": "batch_normalization_30", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "center": true, "axis": -1, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null}, "name": "batch_normalization_30", "inbound_nodes": [[["depthwise_conv2d_10", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_21", "activation": "relu6"}, "name": "activation_21", "inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"use_bias": true, "kernel_size": [1, 1], "name": "conv2d_21", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_constraint": null, "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv2d_21", "inbound_nodes": [[["activation_21", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_31", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "center": true, "axis": -1, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null}, "name": "batch_normalization_31", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "add_6"}, "name": "add_6", "inbound_nodes": [[["batch_normalization_31", 0, 0, {}], ["add_5", 0, 0, {}]]], "class_name": "Add"}, {"config": {"use_bias": true, "kernel_size": [1, 1], "name": "conv2d_22", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_constraint": null, "filters": 384, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv2d_22", "inbound_nodes": [[["add_6", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_32", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "center": true, "axis": -1, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null}, "name": "batch_normalization_32", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_22", "activation": "relu6"}, "name": "activation_22", "inbound_nodes": [[["batch_normalization_32", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"use_bias": true, "kernel_size": [3, 3], "name": "depthwise_conv2d_11", "depth_multiplier": 1, "activation": "linear", "data_format": "channels_last", "depthwise_regularizer": null, "depthwise_constraint": null, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "depthwise_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null}, "name": "depthwise_conv2d_11", "inbound_nodes": [[["activation_22", 0, 0, {}]]], "class_name": "DepthwiseConv2D"}, {"config": {"name": "batch_normalization_33", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "center": true, "axis": -1, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null}, "name": "batch_normalization_33", "inbound_nodes": [[["depthwise_conv2d_11", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_23", "activation": "relu6"}, "name": "activation_23", "inbound_nodes": [[["batch_normalization_33", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"use_bias": true, "kernel_size": [1, 1], "name": "conv2d_23", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_constraint": null, "filters": 96, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv2d_23", "inbound_nodes": [[["activation_23", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_34", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "center": true, "axis": -1, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null}, "name": "batch_normalization_34", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"use_bias": true, "kernel_size": [1, 1], "name": "conv2d_24", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "padding": "same", 